# Computer Lab Exercises week 9  SOLUTIONS

* These lab exercises are designed to introduce the basic syntax of SQL queries and the basic ideas of classes.
* These exercises are **not** part of the assessment of the Module.
* I will post the solutions roughly 1 week after this file has been uploaded to the DLE.
* Please note that pasting python from pdf can sometimes cause problems. For example quotation marks can sometimes be converted incorrectly, so then running python will cause errors.

* See https://sites.google.com/view/pythonforstemstudents/home for a collection
of links to information on python.

## Question 1, SQL queries

This exercise is using SQL to extract information
from the sakila database (**sakila.db**). 
This database is available on the DLE. The cell below is an example of running a SQL command on the database
There is an overview of the sakila database at
https://dev.mysql.com/doc/sakila/en/

Please construct SQL queries to extract:


* The titles of the films.

* The distinct ratings (eg. PG) of the films. To produce the output:
<pre>
PG
G
NC-17
PG-13
R
</pre>

* Find the films with PG rating.

* Count the number of films with different ratings. You will need to use the "group by." The output should look like:
<pre>
G|178
NC-17|210
PG|194
PG-13|223
R|195
</pre>

* Use a SQL query using join to extracte the first_name, last_name, and postal_code from the customer and address table:
<pre>
('MARY', 'SMITH', '35200')
('PATRICIA', 'JOHNSON', '17886')
('LINDA', 'WILLIAMS', '83579')
('BARBARA', 'JONES', '53561')
('ELIZABETH', 'BROWN', '42399')
('JENNIFER', 'DAVIS', '18743')
('MARIA', 'MILLER', '93896')
('SUSAN', 'WILSON', '77948')
('MARGARET', 'MOORE', '45844')
('DOROTHY', 'TAYLOR', '53628')
</pre>

*   Use a SQL query using join to extract the name of the file and the film category. Partial output looks like:
<pre>
YENTL IDAHO|Horror
YOUNG LANGUAGE|Documentary
YOUTH KICK|Music
ZHIVAGO CORE|Horror
ZOOLANDER FICTION|Children
</pre>

In [1]:
# Example code
import sqlite3

def run_sql(database_file, tag, sql_command) :
  connection = sqlite3.connect(database_file)
  cursor = connection.cursor()
  cursor.execute(sql_command + " limit 10") 
  result = cursor.fetchall() 
  print(tag, "Result from running ", sql_command)
  for r in result:
      print(r)

d_file = "sakila.db"

run_sql(d_file, "Example" , "select * from actor")

Example Result from running  select * from actor
(1, 'PENELOPE', 'GUINESS', '2019-04-11 18:11:48')
(2, 'NICK', 'WAHLBERG', '2019-04-11 18:11:48')
(3, 'ED', 'CHASE', '2019-04-11 18:11:48')
(4, 'JENNIFER', 'DAVIS', '2019-04-11 18:11:48')
(5, 'JOHNNY', 'LOLLOBRIGIDA', '2019-04-11 18:11:48')
(6, 'BETTE', 'NICHOLSON', '2019-04-11 18:11:48')
(7, 'GRACE', 'MOSTEL', '2019-04-11 18:11:48')
(8, 'MATTHEW', 'JOHANSSON', '2019-04-11 18:11:48')
(9, 'JOE', 'SWANK', '2019-04-11 18:11:48')
(10, 'CHRISTIAN', 'GABLE', '2019-04-11 18:11:48')

In [2]:
# Put your solution here


import sqlite3

def run_sql(database_file, tag, sql_command) :
  connection = sqlite3.connect(database_file)
  cursor = connection.cursor()
  cursor.execute(sql_command + " limit 10") 
  result = cursor.fetchall() 
  print(tag, "Result from running ", sql_command)
  for r in result:
      print(r)

d_file = "sakila.db"

run_sql(d_file, "Q1a" , "select title from film") 

run_sql(d_file, "Q1b" , "select distinct rating from film") 

run_sql(d_file,"Q1c",r"select title from film where rating='PG'") 

run_sql(d_file,"Q1d","select rating,count(*) from film group by rating") 

run_sql(d_file, "Q1e" , "select first_name, last_name, postal_code from customer inner join address on customer.address_id = address.address_id")

run_sql(d_file, "Q1f" , """ select film.title, category.name from 
     category inner JOIN  film_category on category.category_id 
     = film_category.category_id inner join film 
     on film_category.film_id = film.film_id  """)


#  I didn't ask this question, but it shows how to find the films
#  in the horror category
#
run_sql(d_file, "Q1g" , """ select film.title, category.name  from category 
   inner JOIN  film_category on (category.category_id = 
   film_category.category_id) and ( category.name = 'Horror' ) 
   inner join film on film_category.film_id = film.film_id  """ )

Q1a Result from running  select title from film
('ACADEMY DINOSAUR',)
('ACE GOLDFINGER',)
('ADAPTATION HOLES',)
('AFFAIR PREJUDICE',)
('AFRICAN EGG',)
('AGENT TRUMAN',)
('AIRPLANE SIERRA',)
('AIRPORT POLLOCK',)
('ALABAMA DEVIL',)
('ALADDIN CALENDAR',)
Q1b Result from running  select distinct rating from film
('PG',)
('G',)
('NC-17',)
('PG-13',)
('R',)
Q1c Result from running  select title from film where rating='PG'
('ACADEMY DINOSAUR',)
('AGENT TRUMAN',)
('ALASKA PHANTOM',)
('ALI FOREVER',)
('AMADEUS HOLY',)
('ARIZONA BANG',)
('ARSENIC INDEPENDENCE',)
('BEDAZZLED MARRIED',)
('BEHAVIOR RUNAWAY',)
('BILL OTHERS',)
Q1d Result from running  select rating,count(*) from film group by rating
('G', 178)
('NC-17', 210)
('PG', 194)
('PG-13', 223)
('R', 195)
Q1e Result from running  select first_name, last_name, postal_code from customer inner join address on customer.address_id = address.address_id
('MARY', 'SMITH', '35200')
('PATRICIA', 'JOHNSON', '17886')
('LINDA', 'WILLIAMS', '83579')
('BARBARA', 'JONES', '53561')
('ELIZABETH', 'BROWN', '42399')
('JENNIFER', 'DAVIS', '18743')
('MARIA', 'MILLER', '93896')
('SUSAN', 'WILSON', '77948')
('MARGARET', 'MOORE', '45844')
('DOROTHY', 'TAYLOR', '53628')
Q1f Result from running   select film.title, category.name from
     category inner JOIN  film_category on category.category_id
     = film_category.category_id inner join film
     on film_category.film_id = film.film_id
('ACADEMY DINOSAUR', 'Documentary')
('ACE GOLDFINGER', 'Horror')
('ADAPTATION HOLES', 'Documentary')
('AFFAIR PREJUDICE', 'Horror')
('AFRICAN EGG', 'Family')
('AGENT TRUMAN', 'Foreign')
('AIRPLANE SIERRA', 'Comedy')
('AIRPORT POLLOCK', 'Horror')
('ALABAMA DEVIL', 'Horror')
('ALADDIN CALENDAR', 'Sports')
Q1g Result from running   select film.title, category.name  from category
   inner JOIN  film_category on (category.category_id =
   film_category.category_id) and ( category.name = 'Horror' )
   inner join film on film_category.film_id = film.film_id
('ACE GOLDFINGER', 'Horror')
('AFFAIR PREJUDICE', 'Horror')
('AIRPORT POLLOCK', 'Horror')
('ALABAMA DEVIL', 'Horror')
('ALI FOREVER', 'Horror')
('ANALYZE HOOSIERS', 'Horror')
('ANYTHING SAVANNAH', 'Horror')
('ARABIA DOGMA', 'Horror')
('ARACHNOPHOBIA ROLLERCOASTER', 'Horror')
('BEHAVIOR RUNAWAY', 'Horror')

## Question 2, SQL schema

The cell below creates a SQL table defined by a schema. The aim of this question is to test the actual constraints from the SQL schema.

* The **week** column is the primary key in the orders table. Does sqlite 3 allow nonunique values is the week column?
* Can you add nonintegers to the **orders**  row ?
* Can the FarmID column contain a **None** ?

Once you have tried the above questions I suggest you read https://www.sqlite.org/datatype3.html

In [4]:
import sqlite3
connection = sqlite3.connect("supermarket.db")
cursor = connection.cursor()
# first delete the table
cursor.execute("DROP TABLE IF EXISTS orders")
connection.commit()

# create the table
sql_command = """
CREATE TABLE IF NOT EXISTS orders   ( 
week INTEGER PRIMARY KEY, 
orders INTEGER, 
FarmID INTEGER NOT NULL, 
date DATE);"""

cursor.execute(sql_command)
connection.commit()
#
#  now add some rows
#
sql = ''' INSERT INTO orders(week,orders, FarmID, date)
              VALUES(?,?,?,?) '''

cursor.execute(sql, (1,20,30,"5/11/2022") )
cursor.execute(sql, (2,None,30,"5/11/2022") )
cursor.execute(sql, (3,22,30,"6/11/2022") )
cursor.execute(sql, (4,22,30,"8/11/2022") )

#  write out the table
cursor.execute("SELECT * FROM orders ") 
result = cursor.fetchall() 
for r in result:
  print(r) 
connection.close()

(1, 20, 30, '5/11/2022')
(2, None, 30, '5/11/2022')
(3, 22, 30, '6/11/2022')
(4, 22, 30, '8/11/2022')

In [5]:
#  put your solution here
import sqlite3
connection = sqlite3.connect("supermarket.db")
cursor = connection.cursor()
# first delete the table
cursor.execute("DROP TABLE IF EXISTS orders")
connection.commit()

# create the table
sql_command = """
CREATE TABLE IF NOT EXISTS orders ( 
week INTEGER PRIMARY KEY, 
orders INTEGER, 
FarmID INTEGER NOT NULL, 
date DATE);"""

cursor.execute(sql_command)
connection.commit()
#
#  now add some rows
#
sql = ''' INSERT INTO orders(week,orders, FarmID, date)
              VALUES(?,?,?,?) '''

cursor.execute(sql, (1,20,30,"5/11/2022") )
cursor.execute(sql, (2,None,30,"5/11/2022") )
# cursor.execute(sql, (1,None,30,"5/11/2022") ) # This will fail
cursor.execute(sql, (3,22.5,"hell","6/11/2022") )
cursor.execute(sql, (4,22,22,"8/11/2022") )
#cursor.execute(sql, (4,22,None,"8/11/2022") ) # This will fail

#  write out the table
cursor.execute("SELECT * FROM orders ") 
result = cursor.fetchall() 
for r in result:
  print(r) 
connection.close()

(1, 20, 30, '5/11/2022')
(2, None, 30, '5/11/2022')
(3, 22.5, 'hell', '6/11/2022')
(4, 22, 22, '8/11/2022')

Answers
* NO. The **week** column is the primary key in the orders table. Does sqlite 3 allow nonunique values is the week column?
* YES. Can you add nonintegers to the **orders**  row ?
* No. Can the FarmID column contain a **None** ?

##  Question 3, Classes in python

Consider a cube with side L.

* Volume = $L^3$
* Surface area = 6$L^2$


Start from the code in the cell below and modify the
Rectangle class to create a Cube class. (You do not need to include
any units.) The Cube class should be able to calculate the volume
and surface area.

In [6]:
class Rectangle:
    def __init__(self, x, y):
        self.x = x
        self.y = y
    def area(self):
        return self.x * self.y

rectangle = Rectangle(100, 45)
print ("Area = " , rectangle.area())

Area =  4500

The code calling the class shoud look like:
<pre>
small_cube = Cube(10)
print ("Volume = " , small_cube.volume())
print ("Area = " , small_cube.surface_area())
</pre>
Output
<pre>
Volume =  1000
Area =  600
</pre>

In [4]:
# Put your solution here

class Cube:
    def __init__(self, x):
        self.x = x
    def volume(self):
        return self.x**3
    def surface_area(self):
        return 6 *self.x * self.x 

small_cube = Cube(10)
print ("Volume = " , small_cube.volume())
print ("Area = " , small_cube.surface_area())

Volume =  1000
Area =  600

##  Question 4: classes in python


This question is an example of introducing classes
to improve a python script. The code in the cell below reads in the
data file data-showing-sports-use-of-football-pitches.csv
and counts the number of male football teams in
Plymouth. The data set is from
https://plymouth.thedata.place/dataset/football-pitches

In [33]:
import pandas as pd

# The file below is available on the DLE
fname = "data-showing-sports-use-of-football-pitches.csv"
football_df = pd.read_csv(fname)

print("Loaded data from  " , fname)


male_team_ = football_df['Adult male 11v11 (16-45)']


# drop all rows with any NaN and NaT values
male_team = male_team_.dropna()

xx = len(male_team)

print("Number of male football teams in Plymouth" , xx)

Loaded data from   data-showing-sports-use-of-football-pitches.csv
Number of male football teams in Plymouth 138

The code uses the pandas library https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html
to read the csv file and to do the
processing. However, you do not need to change any of the  
pandas code to
solve
this exercise. You just need to rearrange the source code.

To clean the script up, please put the code into a
class called football.

<pre>
football_plymouth = football()
football_plymouth.load("data-showing-sports-use-of-football-pitches.csv")
number_football_men  = football_plymouth.count_male_team()

print("Number of male football teams in Plymouth" ,number_football_men)
</pre>

In [1]:
# Put your solution here

import pandas as pd

class football:
    def __init__(self):
        # empty dataframe
        self.football_df = pd.DataFrame()

    def load(self,  fname):
        self.football_df = pd.read_csv(fname)
        print("Loaded data from  " , fname)

    def count_male_team(self) :
        male_team_ = self.football_df['Adult male 11v11 (16-45)']
        male_team = male_team_.dropna()
        xx = len(male_team)
        return xx


football_plymouth = football()
football_plymouth.load("data-showing-sports-use-of-football-pitches.csv")
number_football_men  = football_plymouth.count_male_team()

print("Number of male football teams in Plymouth" , number_football_men)

Loaded data from   data-showing-sports-use-of-football-pitches.csv
Number of male football teams in Plymouth 138